Autodesk.Revit.DB.PointClouds.IPointCloudEngineProxy.Free
Revit will call this method when done using the engine.
Since:
2012

Autodesk.Revit.DB.PointClouds.IPointCloudEngineProxy.CreatePointCloudAccess(System.String)
Implement this method to construct the IPointCloudAccess interface for the point cloud designated by
the identifier.  This method is called once during the creation of a PointCloudType.
Remarks:
The instance of the returned IPointCloudAccess is then used by Revit to
display instances of the point cloud in Revit graphics and in the user interface.
identifier:
An identifier unique to the point cloud.  This will be a file name if the
engine was registered as file-based, or an arbitrary identifier if the engine is not file-based.
Returns:
The object that can be used to create iterators and interrogate the
point cloud for its features.
Since:
2012